ERP.belugaerp/src/Documents/битРасчетАвансовПоАкцизам/битРасчетАвансовПоАкцизам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битРасчетАвансовПоАкцизам</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.бг_ОперацииРасчетаАвансовПоАкцизам</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Акцизы</name>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.битРасчетАвансовПоАкцизам</types>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАвансаИсходное</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродажаНаЭкспорт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисленияАванса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/бг_АкцизПоПриобретеннымЦенностям/бг_АкцизПоПриобретеннымЦенностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_АкцизПоПриобретеннымЦенностям</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.битРасчетАвансовПоАкцизам</types>
      <types>CatalogRef.бг_БанковскиеГарантии</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеСырья</name>
    <type>
      <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеОплатыАванса</name>
    <type>
      <types>CatalogRef.бг_СостоянияОплатыАванса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкциза</name>
    <type>
      <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Enums/бг_ОперацииРасчетаАвансовПоАкцизам/бг_ОперацииРасчетаАвансовПоАкцизам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ОперацииРасчетаАвансовПоАкцизам</name>
  <enumValues>
    <name>РасчетАвансов</name>
  </enumValues>
  <enumValues>
    <name>РасчетВозмещенияАвансов</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СостоянияОплатыВходящегоАкциза/бг_СостоянияОплатыВходящегоАкциза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияОплатыВходящегоАкциза</name>
  <enumValues>
    <name>АкцизПоВозвращеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйАкцизВСырье</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйАкцизВСырьеВозвращенныйОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйАкцизНаТоварыВПути</name>
  </enumValues>
  <enumValues>
    <name>АкцизПоНеОплаченнымМЦ</name>
  </enumValues>
  <enumValues>
    <name>АкцизПоОплаченнымМЦ</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет</name>
  </enumValues>
  <enumValues>
    <name>ОплаченАвансЗаАкцизыВБюджет</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СостоянияПодакцизногоСырья/бг_СостоянияПодакцизногоСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияПодакцизногоСырья</name>
  <enumValues>
    <name>ВМестахХранения</name>
  </enumValues>
  <enumValues>
    <name>ВГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВСпиртосодержащейСмеси</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантии</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЭкспортКромеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗСверхНормы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортГарантии</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭСГарантии</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>бг_РазрешитьПараллельнуюСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИнвентаризацияПродукцииЕГАИС</name>
    <type>
      <types>DocumentRef.битИнвентаризацияПродукцииЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СписаниеПотерь</name>
    <type>
      <types>DocumentRef.битСписаниеПотерь</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СписаниеНормативныхПотерьПоАкцизам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битРасчетАвансовПоАкцизам/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды.
	
	УстановитьВидимостьДоступностьЭлементов();
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьДанныеПодвала(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АкцизыПриИзменении(Элемент)
	ОбновитьДанныеПодвала();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьАвансыКОплате(Команда)
	ЗаполнитьАвансыКОплатеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВычетыПоАвансам(Команда)
	ЗаполнитьВычетыПоАвансамНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	РасчетВычетовПоАвансам = (Объект.ХозяйственнаяОперация = Перечисления.бг_ОперацииРасчетаАвансовПоАкцизам.РасчетВозмещенияАвансов);
	
	Элементы.АкцизыЗаполнитьВычетыПоАвансам.Видимость = РасчетВычетовПоАвансам;
	Элементы.АкцизыЗаполнитьАвансыКОплате.Видимость = Не РасчетВычетовПоАвансам;
	Элементы.КорректируемыйПериод.Видимость = Объект.Корректировка;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвансыКОплатеНаСервере()
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	Конецесли;
	
	ДатаРасчета = КонецДня(?(Объект.Корректировка, Объект.КорректируемыйПериод, Объект.Дата));
	АвансыКОплате = Документы.битРасчетАвансовПоАкцизам.АвансыКОплате(Объект.Организация,
																	ДатаРасчета, Объект.Ссылка);
	Объект.Акцизы.Загрузить(АвансыКОплате);

	ОбновитьДанныеПодвала();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВычетыПоАвансамНаСервере()
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	Конецесли;
	
	ДатаРасчета = КонецДня(?(Объект.Корректировка, Объект.КорректируемыйПериод, Объект.Дата));
	ВычетыПоАвансам = Документы.битРасчетАвансовПоАкцизам.ВычетыПоАвансам(Объект.Организация,
																	ДатаРасчета, Объект.Ссылка);
	Объект.Акцизы.Очистить();
	ПериодыСписанияИмпортногоСырья = ПериодыСписанияИмпортногоСырья(ВычетыПоАвансам);
	
	Для Каждого СтрокаВычет Из ВычетыПоАвансам Цикл
		Если СтрокаВычет.СтатусАкциза = Перечисления.бг_СостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ Тогда
			ДополнитьВычетамиПоИмпортномуСырью(СтрокаВычет, ПериодыСписанияИмпортногоСырья);
		Иначе
			НоваяСтрокаАкцизы = Объект.Акцизы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаАкцизы, СтрокаВычет);
			
			НоваяСтрокаАкцизы.ПериодНачисленияАванса = ?(ЗначениеЗаполнено(НоваяСтрокаАкцизы.ПериодНачисленияАванса),
												НоваяСтрокаАкцизы.ПериодНачисленияАванса, КонецМесяца(Объект.Дата));
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьДанныеПодвала();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПодвала(ЗаполнитьСуммуДокумента = Истина)

	Если ЗаполнитьСуммуДокумента = Истина Тогда
		ЗаполнитьСуммуДокумента();
	КонецЕсли;
	
	ИтоговыеПоказатели = "Количество, СуммаАкциза";
	ОтборПродажаНаЭкспорт = Новый Структура("ПродажаНаЭкспорт", Истина);
	ТаблицаПродажаНаЭкспорт = Объект.Акцизы.Выгрузить(ОтборПродажаНаЭкспорт, ИтоговыеПоказатели);
	
	Количество = Объект.Акцизы.Итог("Количество");
	КоличествоЭкспорт = ТаблицаПродажаНаЭкспорт.Итог("Количество");
	СуммаЭкспорт = ТаблицаПродажаНаЭкспорт.Итог("СуммаАкциза");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуДокумента()
	Объект.СуммаДокумента = Документы.битРасчетАвансовПоАкцизам.ПолучитьСуммуДокумента(Объект);
КонецПроцедуры

&НаСервере
Функция ПериодыСписанияИмпортногоСырья(ВычетыПоАвансам)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вычеты.Сделка КАК Сделка,
	|	Вычеты.СтатусАкциза КАК СтатусАкциза,
	|	Вычеты.Номенклатура КАК Номенклатура,
	|	Вычеты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Вычеты.СерияПродукции КАК СерияПродукции
	|ПОМЕСТИТЬ Вычеты
	|ИЗ
	|	&Вычеты КАК Вычеты
	|ГДЕ
	|	Вычеты.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизПоПриобретеннымОбороты.Регистратор КАК Регистратор,
	|	АкцизПоПриобретеннымОбороты.Сделка КАК Сделка,
	|	АкцизПоПриобретеннымОбороты.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	АкцизПоПриобретеннымОбороты.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(АкцизПоПриобретеннымОбороты.Регистратор) = ТИП(Документ.битРасчетАвансовПоАкцизам)
	|			ТОГДА -АкцизПоПриобретеннымОбороты.КоличествоПриход
	|		ИНАЧЕ АкцизПоПриобретеннымОбороты.КоличествоПриход
	|	КОНЕЦ КАК Количество,
	|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(АкцизПоПриобретеннымОбороты.ПериодМесяц, МЕСЯЦ), ДЕНЬ) КАК Период
	|ПОМЕСТИТЬ РасходИмпортногоСырьяПоПериодам
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям.Обороты(
	|			,
	|			,
	|			Авто,
	|			Организация = &Организация
	|				И (Сделка, Номенклатура, СерияНоменклатуры, СерияПродукции) В
	|					(ВЫБРАТЬ
	|						Вычеты.Сделка КАК Сделка,
	|						Вычеты.Номенклатура КАК Номенклатура,
	|						Вычеты.СерияНоменклатуры КАК СерияНоменклатуры,
	|						Вычеты.СерияПродукции КАК СерияПродукции
	|					ИЗ
	|						Вычеты КАК Вычеты)
	|				И СостояниеСырья В (ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВГотовойПродукции),
	|									ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме))) КАК АкцизПоПриобретеннымОбороты
	|ГДЕ
	|	АкцизПоПриобретеннымОбороты.Регистратор <> &Ссылка
	|	И ТИПЗНАЧЕНИЯ(АкцизПоПриобретеннымОбороты.Регистратор) В (
	|									ТИП(Документ.ВнутреннееПотреблениеТоваров),
	|									ТИП(Документ.ЭтапПроизводства2_2),
	|									ТИП(Документ.битРасчетАвансовПоАкцизам))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИмпортногоСырьяПоПериодам.Сделка КАК Сделка,
	|	РасходИмпортногоСырьяПоПериодам.Номенклатура КАК Номенклатура,
	|	РасходИмпортногоСырьяПоПериодам.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РасходИмпортногоСырьяПоПериодам.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РасходИмпортногоСырьяПоПериодам.Регистратор) = ТИП(Документ.битРасчетАвансовПоАкцизам)
	|			ТОГДА РасходИмпортногоСырьяПоПериодам.СостояниеОплатыАванса.Период
	|		ИНАЧЕ РасходИмпортногоСырьяПоПериодам.Период
	|	КОНЕЦ КАК Период
	|ИЗ
	|	РасходИмпортногоСырьяПоПериодам КАК РасходИмпортногоСырьяПоПериодам
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходИмпортногоСырьяПоПериодам.Сделка,
	|	РасходИмпортногоСырьяПоПериодам.Номенклатура,
	|	РасходИмпортногоСырьяПоПериодам.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РасходИмпортногоСырьяПоПериодам.Регистратор) = ТИП(Документ.битРасчетАвансовПоАкцизам)
	|			ТОГДА РасходИмпортногоСырьяПоПериодам.СостояниеОплатыАванса.Период
	|		ИНАЧЕ РасходИмпортногоСырьяПоПериодам.Период
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасходИмпортногоСырьяПоПериодам.Количество) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("Вычеты", ВычетыПоАвансам);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
КонецФункции

&НаСервере
Процедура ДополнитьВычетамиПоИмпортномуСырью(ДанныеВычет, ПериодыСписанияИмпортногоСырья)
	Отбор = Новый Структура("Сделка, Номенклатура, СерияНоменклатуры");
	ЗаполнитьЗначенияСвойств(Отбор, ДанныеВычет);
	
	СтрокиПериодыСписания = ПериодыСписанияИмпортногоСырья.НайтиСтроки(Отбор);
	
	КоличествоРаспределить = ДанныеВычет.Количество;
	Для Каждого СтрокаПериодСписания Из СтрокиПериодыСписания Цикл
		Если СтрокаПериодСписания.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоРаспределено = ?(КоличествоРаспределить > СтрокаПериодСписания.Количество, СтрокаПериодСписания.Количество, КоличествоРаспределить);
		
		НоваяСтрокаАкциз = Объект.Акцизы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАкциз, ДанныеВычет);
		НоваяСтрокаАкциз.ПериодНачисленияАванса = СтрокаПериодСписания.Период;
		НоваяСтрокаАкциз.Количество = КоличествоРаспределено;
		НоваяСтрокаАкциз.СуммаАкциза = НоваяСтрокаАкциз.Количество * НоваяСтрокаАкциз.НалоговаяСтавка * 10;
		
		СтрокаПериодСписания.Количество = СтрокаПериодСписания.Количество - КоличествоРаспределено;
		КоличествоРаспределить = КоличествоРаспределить - КоличествоРаспределено;
		
		Если КоличествоРаспределить = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоРаспределить > 0 Тогда
		НоваяСтрокаАкциз = Объект.Акцизы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАкциз, ДанныеВычет);
		НоваяСтрокаАкциз.Количество = КоличествоРаспределено;
		НоваяСтрокаАкциз.СуммаАкциза = НоваяСтрокаАкциз.Количество * НоваяСтрокаАкциз.НалоговаяСтавка * 10;
		НоваяСтрокаАкциз.ПериодНачисленияАванса = КонецМесяца(Объект.Дата);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
